In [241]:
print(True == False)
print(True != 0)
print(False == 0)
print(True or False)
print(1 == '1')

#문제
print(True == (False != 1))

False
True
True
True
False
True

In [242]:
eng = 'Korea COVID 19'
print(eng.lower())
print(eng.upper())

korea covid 19
KOREA COVID 19

In [243]:
data = []
data.append('java')
data.append('python')
data.append('c')
data[0],data[-1],data[1:],data[:2]
data.sort()
print(data)
data.reverse()
print(data)

['c', 'java', 'python']
['python', 'java', 'c']

In [244]:
a = []
a.append('hello')
a.append('world')
a.reverse()
a

['world', 'hello']

In [1]:
b=(1,2,3,'사','오')
c =1,2,3
type(b),type(c)
b[3]
b[3:],b[1:4]

(('사', '오'), (2, 3, '사'))

In [18]:
dic = {'name1':'경민','학번1':20103,'name2':'경민2','학번2':20104}
print(dic.get('name1'))
print(dic.keys())
print(dic.values())

경민
dict_keys(['name1', '학번1', 'name2', '학번2'])
dict_values(['경민', 20103, '경민2', 20104])

In [24]:
lunch = {'햄버거','치킨','라면','콜라',10000}
dinner = {'피자','족발','라면','콜라',10000}
print(lunch & dinner)
print(lunch | dinner)

{10000, '라면', '콜라'}
{'치킨', '족발', '피자', '콜라', 10000, '햄버거', '라면'}

### 판다스

In [246]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: numpy>=1.13.3 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [5]:
li = [1,2,3]
li

[1, 2, 3]

In [7]:
type(li)

list

In [10]:
s1= pd.core.series.Series(li)
s1

0    1
1    2
2    3
dtype: int64

In [13]:
s2= pd.core.series.Series(['일','이','심'])
s2

0    일
1    이
2    심
dtype: object

In [16]:
data = dict(num=s1,word=s2)
data

{'num': 0    1
 1    2
 2    3
 dtype: int64, 'word': 0    일
 1    이
 2    심
 dtype: object}

In [19]:
pd.DataFrame(data)

   num word
0    1    일
1    2    이
2    3    심

In [33]:
data = pd.DataFrame([['a',100],['b',200],['c',300]])
data

   0    1
0  a  100
1  b  200
2  c  300

In [34]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
0    3 non-null object
1    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [41]:
data.head(2)

   0    1
0  a  100
1  b  200

In [42]:
data.tail(2)

   0    1
1  b  200
2  c  300

In [66]:
col=['1군','2군']

In [98]:
pd.DataFrame(data,columns=col)

   1군  2군  3군
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN

In [77]:
man = [{'Name':'은주','Age':20,'Job':'J1'},
       {'Name':'소주','Age':30,'Job':'J2'},
       {'Name':'대주','Age':40,'Job':'J3'}
      ]
pd.DataFrame(man,index=[1,2,3])

  Name  Age Job
1   은주   20  J1
2   소주   30  J2
3   대주   40  J3

In [96]:
a=[1,2,3]
b=[4,5,6]
df = [a,b]
dd = pd.DataFrame(df,index=[1,2],columns=['A','B','C'])
dd

   A  B  C
1  1  2  3
2  4  5  6

In [108]:
person=[
    ['a',100,80],['b',17,60],['b',50,40],['d',90,80]
]
col_name = ['name','국어','영어']
df = pd.DataFrame.from_records(person, columns = col_name, index=[1,2,3,4])

df[['국어','영어']]>70

      국어     영어
1   True   True
2  False  False
3  False  False
4   True   True

In [112]:
person=[
    ['A',90,85,100],['B',17,60,40],['C',50,45,80],['D',60,80,75],['E',100,90,95]
]
col_name = ['name','국어','영어','수학']
df = pd.DataFrame.from_records(person, columns = col_name, index=[1,2,3,4,5])

df[['국어','영어','수학']]>=80

      국어     영어     수학
1   True   True   True
2  False  False  False
3  False  False   True
4  False   True  False
5   True   True   True